In [1]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

In [2]:
#Five functions of the pandas library are--
# (1)set_index() 
# (2)DataFrame(,index[])
# (3)iterrows()
# (4)apply()
# (5)applymap()

data = {"Name" :['sumit' , 'rahul' , 'yuvraj' , 'krish'],
       "a":[1,2,3,4] ,
       "b":[5,6,7,8]
       }
df = pd.DataFrame(data)

In [3]:
df

     Name  a  b
0   sumit  1  5
1   rahul  2  6
2  yuvraj  3  7
3   krish  4  8

In [4]:
#1
df.set_index(['a'])

     Name  b
a
1   sumit  5
2   rahul  6
3  yuvraj  7
4   krish  8

In [5]:
#2
df1 = pd.DataFrame(data,index=['a','b','c','d'])
df1

     Name  a  b
a   sumit  1  5
b   rahul  2  6
c  yuvraj  3  7
d   krish  4  8

In [6]:
#3
for i,j in df1.iterrows():    #columns indexing
    print(j)

Name    sumit
a           1
b           5
Name: a, dtype: object
Name    rahul
a           2
b           6
Name: b, dtype: object
Name    yuvraj
a            3
b            7
Name: c, dtype: object
Name    krish
a           4
b           8
Name: d, dtype: object

In [7]:
#4
def test(x):             # apply is used in row wise and
                         #   colunm wise
    return x.sum()
df1.apply(test)

Name    sumitrahulyuvrajkrish
a                          10
b                          26
dtype: object

In [8]:
df2 =df[['a','b']]
df2
df2.applymap(lambda x : x**2)

    a   b
0   1  25
1   4  36
2   9  49
3  16  64

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [9]:
data1 = {"A":[1,2,3,4],
        "B":[5,6,7,8],
        "C":['a','b','c','d']
        }
df = pd.DataFrame(data1)
df

   A  B  C
0  1  5  a
1  2  6  b
2  3  7  c
3  4  8  d

In [10]:
df1 = pd.DataFrame(data,index=[1,3,5,7])
df1

     Name  a  b
1   sumit  1  5
3   rahul  2  6
5  yuvraj  3  7
7   krish  4  8

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [11]:
data2 = {"Value":[10,20,30,40,50]}
df = pd.DataFrame(data2)
df3 = df.head(3)
df3.sum()

Value    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [12]:
df4 = pd.DataFrame({"Text":["pandas is a software library written for the Python programming language for data manipulation and analysis. In particular.it offers data structures and operations for manipulating numerical tables and time series"," It is free software released under the three-clause BSD license."]})
df4['Word_count'] = df4['Text'].apply(lambda x:len(x.split()))

In [13]:
df4

                                                Text  Word_count
0  pandas is a software library written for the P...          30
1   It is free software released under the three-...          10

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [14]:
#Ans:-- DataFrame.size() returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.
        #DataFrame.shape() returns tuple of shape (Rows, columns) of dataframe/series

Q6. Which function of pandas do we use to read an excel file?

In [40]:
import pandas as pd
df = pd.read_excel("excel_file_name")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [15]:
df7 = pd.DataFrame({"Email":["Username1@domian.com" , "username2@domain.com" , "username3@domain.com"]})
df7['Username'] = df7['Email'].iteritem()

AttributeError: 'Series' object has no attribute 'iteritem'

In [ ]:
df7

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

   A   B   C

0  3   5   1

1  8   2   7

2  6   9   4

3  2   3   5

4  9   1   2

In [16]:
df8 = pd.DataFrame({"A":[3,8,6,2,9],
                   "B":[5,2,9,3,1],
                   "c":[1,7,4,5,2]})
df8

   A  B  c
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [17]:
new_df8 = df8[(df8['A'] > 5) & (df8['B'] < 10)] 
new_df8

   A  B  c
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [18]:
df9 = pd.DataFrame({"values":[1,2,3,4,5,]})
df9

   values
0       1
1       2
2       3
3       4
4       5

In [19]:
df9['values'].mean()

3.0

In [20]:
df9['values'].median()

3.0

In [21]:
df9['values'].std()

1.5811388300841898

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [22]:
df10 = pd.DataFrame({"Sales":[100,200,120,150,245,300,450], 
                   "Date":['2022-05-12' , '2023-05-13', '2023-05-14', '2023-05-15', '2023-05-16', '2023-05-17', '2023-05-18']})
df10

   Sales        Date
0    100  2022-05-12
1    200  2023-05-13
2    120  2023-05-14
3    150  2023-05-15
4    245  2023-05-16
5    300  2023-05-17
6    450  2023-05-18

In [23]:
df10['MovingAverage'] = (df10['Sales']).median()
df10

   Sales        Date  MovingAverage
0    100  2022-05-12          200.0
1    200  2023-05-13          200.0
2    120  2023-05-14          200.0
3    150  2023-05-15          200.0
4    245  2023-05-16          200.0
5    300  2023-05-17          200.0
6    450  2023-05-18          200.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:

         Date

0  2023-01-01

1  2023-01-02

2  2023-01-03

3  2023-01-04

4  2023-01-05

In [24]:
import datetime
data = pd.date_range(start ='2023-01-01' , end = '2023-01-05')
df11 = pd.DataFrame({'Date': data})
df11
# df11 = pd.DataFrame({"Date":['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})
# df11

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [25]:
df11["Weekday"] = df11["Date"].apply(lambda x: datetime.datetime.strftime(x, '%A'))
df11

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [26]:
data = pd.date_range( start = '2022-12-01' , end = '2023-02-20')
df12 = pd.DataFrame(data)
df12

            0
0  2022-12-01
1  2022-12-02
2  2022-12-03
3  2022-12-04
4  2022-12-05
..        ...
77 2023-02-16
78 2023-02-17
79 2023-02-18
80 2023-02-19
81 2023-02-20

[82 rows x 1 columns]

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [27]:
#Ans:--Pandas library